<template>
  <div>
    <h2>关于我们</h2>
    <p>
      暂且抛开技能层面的东西不说，我认为要成为优秀的技术人员，最重要的是要知道和善于发挥自己的长处，很多优秀的技术牛人熟知并且善于此道，所以牛人往往有个性，因为他们的特点和长处鲜明。而作为合格的管理者呢？最重要的不是发挥自己的长处和宣扬自己的个性，而是要看到自己的短处，要磨圆自身，在此之上，要知道和善于发挥他人的长处，容忍他人之短。从上面这一点来比较，可以看出技术和管理其实不是同一个维度的东西，并且也可以知道，很多优秀的技术人员有机会转为管理角色时，为什么有一段艰难的时期 —— 因为思维没能转换过来，从而技能点加得不对。
    </p>
  </div>
</template>

<script>
export default {
  name: "About",
  created() {
    console.log('About created');
  },
  destroyed() {
    console.log('About destroyed');
  }
}
</script>

<style scoped>

</style>
