<template>
  <div>
    <h2>我是用户界面</h2>
    <p>
      大家记得那个小马过河的寓言故事吗？松鼠觉得水深，老牛觉得水浅，究竟是谁对呢？技术管理者常犯的错是以自己的感觉去代入团队成员的感觉。“为什么这个事情这么简单，‘他’却做不好？不如我自己做吧。““这些事情那么繁琐，我都不愿意做，更不要麻烦底下的兄弟们，还是我自己来做吧。”上面两个情况，是否各位做管理的同学都遇到过？就像每个家庭的父母都以为自己了解孩子的一切，但其实你真的不了解，你所看到的与事实的真相差得很远。很多时候，一个成员要走了，你跟他一聊，才知道原来你对他的期望以及判断，与他自己的期望以及判断相差得很远很远。出现这种情况又是谁的疏忽？
    </p>
    <h2>{{$route.params.id}}</h2>
  </div>
</template>

<script>
export default {
  name: "User",
  created() {
    console.log('User created');
  },
  destroyed() {
    console.log('User destroyed');
  }
}
</script>

<style scoped>

</style>
